mhmayyan/CUIR_Boards/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# IR_Sensor_Board

IR_Sensor_Board.name=IR_Sensor_Board

IR_Sensor_Board.build.vid=0x0483
IR_Sensor_Board.build.core=arduino
IR_Sensor_Board.build.board=IR_Sensor_Board
IR_Sensor_Board.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# IR_Sensor_Board board

IR_Sensor_Board.upload.maximum_size=196608
IR_Sensor_Board.upload.maximum_data_size=20480
IR_Sensor_Board.build.mcu=cortex-m0
IR_Sensor_Board.build.board=IR_Sensor_Board
IR_Sensor_Board.build.series=STM32L0xx
IR_Sensor_Board.build.product_line=STM32L082xx
IR_Sensor_Board.build.variant=IR_Sensor_Board
IR_Sensor_Board.build.cmsis_lib_gcc=arm_cortexM0l_math

############# Serialx activation
IR_Sensor_Board.menu.xserial.generic=Enabled (generic 'Serial')
IR_Sensor_Board.menu.xserial.none=Enabled (no generic 'Serial')
IR_Sensor_Board.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
IR_Sensor_Board.menu.xserial.disabled=Disabled (No Serial support)
IR_Sensor_Board.menu.xserial.disabled.build.xSerial=


#################### USB connectivity
IR_Sensor_Board.menu.usb.none=None
IR_Sensor_Board.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
IR_Sensor_Board.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
IR_Sensor_Board.menu.usb.CDC=CDC (no generic 'Serial')
IR_Sensor_Board.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
IR_Sensor_Board.menu.usb.HID=HID (keyboard and mouse)
IR_Sensor_Board.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
IR_Sensor_Board.menu.xusb.FS=Low/Full Speed
IR_Sensor_Board.menu.xusb.HS=High Speed
IR_Sensor_Board.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
IR_Sensor_Board.menu.xusb.HSFS=High Speed in Full Speed mode
IR_Sensor_Board.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

############## Optimizations
IR_Sensor_Board.menu.opt.osstd=Smallest (-Os default)
IR_Sensor_Board.menu.opt.oslto=Smallest (-Os) with LTO
IR_Sensor_Board.menu.opt.oslto.build.flags.optimize=-Os -flto
IR_Sensor_Board.menu.opt.o1std=Fast (-O1)
IR_Sensor_Board.menu.opt.o1std.build.flags.optimize=-O1
IR_Sensor_Board.menu.opt.o1lto=Fast (-O1) with LTO
IR_Sensor_Board.menu.opt.o1lto.build.flags.optimize=-O1 -flto
IR_Sensor_Board.menu.opt.o2std=Faster (-O2)
IR_Sensor_Board.menu.opt.o2std.build.flags.optimize=-O2
IR_Sensor_Board.menu.opt.o2lto=Faster (-O2) with LTO
IR_Sensor_Board.menu.opt.o2lto.build.flags.optimize=-O2 -flto
IR_Sensor_Board.menu.opt.o3std=Fastest (-O3)
IR_Sensor_Board.menu.opt.o3std.build.flags.optimize=-O3
IR_Sensor_Board.menu.opt.o3lto=Fastest (-O3) with LTO
IR_Sensor_Board.menu.opt.o3lto.build.flags.optimize=-O3 -flto
IR_Sensor_Board.menu.opt.ogstd=Debug (-g)
IR_Sensor_Board.menu.opt.ogstd.build.flags.optimize=-g -Og

########## C Runtime Library
IR_Sensor_Board.menu.rtlib.nano=Newlib Nano (default)
IR_Sensor_Board.menu.rtlib.nanofp=Newlib Nano + Float Printf
IR_Sensor_Board.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
IR_Sensor_Board.menu.rtlib.nanofs=Newlib Nano + Float Scanf
IR_Sensor_Board.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
IR_Sensor_Board.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
IR_Sensor_Board.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
IR_Sensor_Board.menu.rtlib.full=Newlib Standard
IR_Sensor_Board.menu.rtlib.full.build.flags.ldspecs=

############# Upload menu
IR_Sensor_Board.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
IR_Sensor_Board.menu.upload_method.serialMethod.upload.protocol=1
IR_Sensor_Board.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
IR_Sensor_Board.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

IR_Sensor_Board.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
IR_Sensor_Board.menu.upload_method.swdMethod.upload.protocol=0
IR_Sensor_Board.menu.upload_method.swdMethod.upload.options=-g
IR_Sensor_Board.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

IR_Sensor_Board.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
IR_Sensor_Board.menu.upload_method.dfuMethod.upload.protocol=2
IR_Sensor_Board.menu.upload_method.dfuMethod.upload.options=-g
IR_Sensor_Board.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

IR_Sensor_Board.menu.upload_method.MassStorage=Mass Storage
IR_Sensor_Board.menu.upload_method.MassStorage.upload.protocol=
IR_Sensor_Board.menu.upload_method.MassStorage.upload.tool=massStorageCopy

################################################################################
# IR_Mouse

IR_Mouse.name=IR_Mouse

IR_Mouse.build.vid=0x0483
IR_Mouse.build.core=arduino
IR_Mouse.build.board=IR_Mouse
IR_Mouse.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# IR_Mouse board

IR_Mouse.upload.maximum_size=196608
IR_Mouse.upload.maximum_data_size=20480
IR_Mouse.build.mcu=cortex-m0
IR_Mouse.build.board=IR_Mouse
IR_Mouse.build.series=STM32L0xx
IR_Mouse.build.product_line=STM32L082xx
IR_Mouse.build.variant=IR_Mouse
IR_Mouse.build.cmsis_lib_gcc=arm_cortexM0l_math

############# Serialx activation
IR_Mouse.menu.xserial.generic=Enabled (generic 'Serial')
IR_Mouse.menu.xserial.none=Enabled (no generic 'Serial')
IR_Mouse.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
IR_Mouse.menu.xserial.disabled=Disabled (No Serial support)
IR_Mouse.menu.xserial.disabled.build.xSerial=


#################### USB connectivity
IR_Mouse.menu.usb.none=None
IR_Mouse.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
IR_Mouse.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
IR_Mouse.menu.usb.CDC=CDC (no generic 'Serial')
IR_Mouse.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
IR_Mouse.menu.usb.HID=HID (keyboard and mouse)
IR_Mouse.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
IR_Mouse.menu.xusb.FS=Low/Full Speed
IR_Mouse.menu.xusb.HS=High Speed
IR_Mouse.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
IR_Mouse.menu.xusb.HSFS=High Speed in Full Speed mode
IR_Mouse.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

############## Optimizations
IR_Mouse.menu.opt.osstd=Smallest (-Os default)
IR_Mouse.menu.opt.oslto=Smallest (-Os) with LTO
IR_Mouse.menu.opt.oslto.build.flags.optimize=-Os -flto
IR_Mouse.menu.opt.o1std=Fast (-O1)
IR_Mouse.menu.opt.o1std.build.flags.optimize=-O1
IR_Mouse.menu.opt.o1lto=Fast (-O1) with LTO
IR_Mouse.menu.opt.o1lto.build.flags.optimize=-O1 -flto
IR_Mouse.menu.opt.o2std=Faster (-O2)
IR_Mouse.menu.opt.o2std.build.flags.optimize=-O2
IR_Mouse.menu.opt.o2lto=Faster (-O2) with LTO
IR_Mouse.menu.opt.o2lto.build.flags.optimize=-O2 -flto
IR_Mouse.menu.opt.o3std=Fastest (-O3)
IR_Mouse.menu.opt.o3std.build.flags.optimize=-O3
IR_Mouse.menu.opt.o3lto=Fastest (-O3) with LTO
IR_Mouse.menu.opt.o3lto.build.flags.optimize=-O3 -flto
IR_Mouse.menu.opt.ogstd=Debug (-g)
IR_Mouse.menu.opt.ogstd.build.flags.optimize=-g -Og

########## C Runtime Library
IR_Mouse.menu.rtlib.nano=Newlib Nano (default)
IR_Mouse.menu.rtlib.nanofp=Newlib Nano + Float Printf
IR_Mouse.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
IR_Mouse.menu.rtlib.nanofs=Newlib Nano + Float Scanf
IR_Mouse.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
IR_Mouse.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
IR_Mouse.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
IR_Mouse.menu.rtlib.full=Newlib Standard
IR_Mouse.menu.rtlib.full.build.flags.ldspecs=

############# Upload menu
IR_Mouse.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
IR_Mouse.menu.upload_method.serialMethod.upload.protocol=1
IR_Mouse.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
IR_Mouse.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

IR_Mouse.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
IR_Mouse.menu.upload_method.swdMethod.upload.protocol=0
IR_Mouse.menu.upload_method.swdMethod.upload.options=-g
IR_Mouse.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

IR_Mouse.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
IR_Mouse.menu.upload_method.dfuMethod.upload.protocol=2
IR_Mouse.menu.upload_method.dfuMethod.upload.options=-g
IR_Mouse.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

IR_Mouse.menu.upload_method.MassStorage=Mass Storage
IR_Mouse.menu.upload_method.MassStorage.upload.protocol=
IR_Mouse.menu.upload_method.MassStorage.upload.tool=massStorageCopy

